app/views/posts/index.html.erb

  <% @posts.each do |post| %>
    <li><%= link_to post.post_title, post %> by <%= post.user.email %> | <%=  post.created_at.to_formatted_s(:long_ordinal) %> | <%= post.comments.count %> comments </li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]