app/controllers/comments_controller.rb

INSERT INTO "comments" ("comment_text", "comment_user", "created_at", "post_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment_text", "this is a ocmment"], ["comment_user", "shayna"], ["created_at", "2014-10-14 02:04:41.125139"], ["post_id", 3], ["updated_at", "2014-10-14 02:04:41.125139"]]
UPDATE "comments" SET "updated_at" = $1, "user_id" = $2 WHERE "comments"."id" = 1  [["updated_at", "2014-10-15 00:45:46.327827"], ["user_id", 1]]
---
def create
  @comment = Comment.create(comment_params)
  @comment.user = current_user
  if @comment.save