app/controllers/posts_controller.rb

INSERT INTO "posts" ("category", "created_at", "post_content", "post_title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category", "cats"], ["created_at", "2014-10-15 00:17:38.958498"], ["post_content", "it's really excellent"], ["post_title", "here is a new post"], ["updated_at", "2014-10-15 00:17:38.958498"]]
UPDATE "posts" SET "updated_at" = $1, "user_id" = $2 WHERE "posts"."id" = 9  [["updated_at", "2014-10-15 01:01:05.762546"], ["user_id", 1]]
---
  def create
    @post = Post.create(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "post_user" = $1, "updated_at" = $2 WHERE "posts"."id" = 6  [["post_user", "shaynac"], ["updated_at", "2014-10-14 03:02:25.585434"]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)